app/views/leads/_form_completion.html.erb

    <%= f.label "Select Your Areas Of Interest ( You can select more than 1 option):" %><br />
    <%= f.collection_check_boxes :origin_ids, Origin.all, :id, :name do |b| %>
---
SELECT "origins".* FROM "origins"