app/controllers/leads_controller.rb

  def create
    @lead = Lead.new(lead_params)

    respond_to do |format|
      if @lead.save
---
INSERT INTO "leads" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Ana Carolina Silva"], ["email", "anacarolina.usp@gmail.com"], ["created_at", 2017-06-14 04:15:06 UTC], ["updated_at", 2017-06-14 04:15:06 UTC]]

  def update
    respond_to do |format|
      if @lead.update(lead_params)
---
UPDATE "leads" SET "name" = $1, "phone" = $2, "company" = $3, "updated_at" = $4 WHERE "leads"."id" = $5  [["name", "ANA CAROLINA ALBERTINO DA SILVA"], ["phone", "7866131100"], ["company", "OTM"], ["updated_at", 2017-06-14 04:16:51 UTC], ["id", 4]]

    def set_lead
      @lead = Lead.find(params[:id])
---
SELECT  "leads".* FROM "leads" WHERE "leads"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]